## Pandas

**Pandas**

Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

Pandas allows us to analyze big data and make conclusions based on statistical theories.
Pandas can clean messy data sets, and make them readable and relevant.

**Installation of Pandas**

If you have Python and PIP already installed on a system, then installation of Pandas is very easy.
Install it using this command:
C:\Users\Your Name>pip install pandas

Import Pandas:
Once Pandas is installed, import it in your applications by adding the import keyword:

In [2]:
# pip install pandas
import pandas as pd
pd.__version__

'2.3.3'

**What is a Series?**

A Pandas Series is like a column in a table.

It is a one-dimensional array holding data of any type.

**Labels**

If nothing else is specified, the values are labeled with their index number. First value has index 0, second value has index 1 etc.

This label can be used to access a specified value.

**Create Labels**

With the index argument, you can name your own labels.

When you have created labels, you can access an item by referring to the label.

You can also use a key/value object, like a dictionary, when creating a Series.

In [3]:
#Pandas Series
# Create a simple Pandas Series from a list:
name = ['Shahid','Ali','Imran']
s1 = pd.Series(name)
s1

0    Shahid
1       Ali
2     Imran
dtype: object

In [4]:
s1 = pd.Series(name,index=['First','Second','Third'])
s1

First     Shahid
Second       Ali
Third      Imran
dtype: object

In [5]:
dic1 = {'Label1':'Value1', 'Label2':'Value2', 'Label3':'Value3'}
s2 = pd.Series(dic1)
print(s2)

Label1    Value1
Label2    Value2
Label3    Value3
dtype: object

In [ ]:
#Quering a series index_lable based 
s1.loc['First': 'second']

First     Shahid
Second       Ali
Third      Imran
dtype: object

In [12]:
#Quering a series by intiger index  based 

s1.iloc[0]

'Shahid'

In [26]:
# import warnings

In [27]:
# Also we can do
s1['First']

'Shahid'

In [28]:
# get first element by position (works regardless of index labels)
s1.iloc[0]

'Shahid'

In [33]:
s1.loc["Second"]

'Ali'

In [44]:
# Iterartion through pandas series
for label,value in s1.items():
    print(value)

Shahid
Ali
Imran

In [45]:
s1.index

Index(['First', 'Second', 'Third'], dtype='object')

In [50]:
# joining two series

join_series = pd.concat([s1,s2])
join_series

First     Shahid
Second       Ali
Third      Imran
Label1    Value1
Label2    Value2
Label3    Value3
dtype: object

**Pandas DataFrame**

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

Data sets in Pandas are usually multi-dimensional tables, called DataFrames.

Series is like a column, a DataFrame is the whole table.

With the index argument, you can name your own indexes.

In [51]:
# Create a simple Pandas DataFrame:

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

#load data into a DataFrame object:
df = pd.DataFrame(data)

print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [52]:
# Pandas DataFrame With the index argument

students = [{'Name':'Ahmad', 'Class':'Physics', 'Score':99},
            {'Name':'Ali', 'Class':'Chemistry', 'Score':90},
            {'Name':'Muhammad', 'Class':'Biology', 'Score':82}]

df = pd.DataFrame(students, index=['s1','s2','s3'])


"""
students = {
    'Name': ['Ahmad', 'Ali', 'Muhammad'],
    'Class': ['Physics', 'Chemistry', 'Biology'],
    'Score': [99, 90, 80]
}
df = pd.DataFrame(students, index=['s1','s2','s3'])
df"""
df

        Name      Class  Score
s1     Ahmad    Physics     99
s2       Ali  Chemistry     90
s3  Muhammad    Biology     82

Locate Row

As you can see from the result above, the DataFrame is like a table with rows and columns.

Pandas use the loc attribute to return one or more specified row(s)

In [53]:
#Quering
df.loc['s1']

Name       Ahmad
Class    Physics
Score         99
Name: s1, dtype: object

In [54]:
df.iloc[0]

Name       Ahmad
Class    Physics
Score         99
Name: s1, dtype: object

In [55]:
#Name of s1
df.loc['s1']['Name']

'Ahmad'

In [56]:
#Name of s1
df.loc['s1','Name']

'Ahmad'

In [57]:
df.loc['s1',['Name','Score']]

Name     Ahmad
Score       99
Name: s1, dtype: object

In [58]:
#Slicing
df.loc[:,'Name']

s1       Ahmad
s2         Ali
s3    Muhammad
Name: Name, dtype: object

In [59]:
#For column
df.T.loc['Name']

s1       Ahmad
s2         Ali
s3    Muhammad
Name: Name, dtype: object

In [60]:
#Also directly
df['Name']

s1       Ahmad
s2         Ali
s3    Muhammad
Name: Name, dtype: object

In [61]:
#Deleting s1 row
df.drop('s1')

        Name      Class  Score
s2       Ali  Chemistry     90
s3  Muhammad    Biology     82

In [87]:
#deleting score column
df.drop('Score', inplace=False, axis=1)
#df=df.drop(columns=['Score','Class'],axis=1)

                    Name            Class       New Column
s1                 Ahmad          Physics          Regular
s2                   Ali        Chemistry          Regular
s3              Muhammad          Biology          Regular
New Row  New row element  New row element  New row element

In [88]:
#Adding new column
df['New Column'] = 'Regular'

In [89]:
#Adding New row
df.loc['New Row'] ='New row element'

In [90]:
df

                    Name            Class            Score       New Column
s1                 Ahmad          Physics               99          Regular
s2                   Ali        Chemistry               90          Regular
s3              Muhammad          Biology               82          Regular
New Row  New row element  New row element  New row element  New row element

**Pandas Read CSV**

A simple way to store big data sets is to use CSV files (comma separated files).

CSV files contains plain text and is a well know format that can be read by everyone including Pandas.

In our examples we will be using a CSV file called 'data.csv'.

Download Dataset: https://github.com/waqarkhan1000/Numpy-Panda

In [92]:
#Loading a csv file
df = pd.read_csv('data.csv')
df.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

**Pandas - Analyzing DataFrames**

Viewing the Data

The head() method returns the headers and a specified number of rows, starting from the top.

There is also a tail() method for viewing the last rows of the DataFrame.

The tail() method returns the headers and a specified number of rows, starting from the bottom.

In [102]:
#Setting first column as index
df1 = pd.read_csv('data.csv', index_col=0)
df1.head()

          Pulse  Maxpulse  Calories
Duration
60          110       130     409.1
60          117       145     479.0
60          103       135     340.0
45          109       175     282.4
45          117       148     406.0

The DataFrames object has a method called info(), that gives you more information about the data set.

In [103]:
# Print information about the data:

print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB
None

In [104]:
df2 = df.rename(mapper=str.strip, axis='columns')
df2

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [105]:
#Renaming column
df2 = df.rename(columns={'Duration':'Duration', 'Pulse':'P', 'Maxpulse':'M_P'})
df2.head(2)

   Duration    P  M_P  Calories
0        60  110  130     409.1
1        60  117  145     479.0

In [106]:
df.columns

Index(['Duration', 'Pulse', 'Maxpulse', 'Calories'], dtype='object')

In [107]:
df.columns = [x.lower().strip() for x in df.columns]
df.columns

Index(['duration', 'pulse', 'maxpulse', 'calories'], dtype='object')

In [108]:
#Quering df using boolean masking
mask = df['duration'] <= 45
mask

0      False
1      False
2      False
3       True
4       True
       ...
164    False
165    False
166    False
167    False
168    False
Name: duration, Length: 169, dtype: bool

In [109]:
df.where(mask).head()

   duration  pulse  maxpulse  calories
0       NaN    NaN       NaN       NaN
1       NaN    NaN       NaN       NaN
2       NaN    NaN       NaN       NaN
3      45.0  109.0     175.0     282.4
4      45.0  117.0     148.0     406.0

In [112]:
df.where(mask).dropna().head(2)

   duration  pulse  maxpulse  calories
3      45.0  109.0     175.0     282.4
4      45.0  117.0     148.0     406.0

In [113]:
df[df['duration']<=45].dropna().head(2)  #same as above

   duration  pulse  maxpulse  calories
3        45    109       175     282.4
4        45    117       148     406.0

In [114]:
#Indexing a dataframe
df = pd.read_csv('data.csv',index_col=0)
df.head(2)

          Pulse  Maxpulse  Calories
Duration
60          110       130     409.1
60          117       145     479.0

In [115]:
#removing duration from index col
df['Duration'] = df.index
df = df.set_index('Pulse')
df.head(2)

       Maxpulse  Calories  Duration
Pulse
110         130     409.1        60
117         145     479.0        60

In [116]:
df = df.reset_index()
df.head(2)

   Pulse  Maxpulse  Calories  Duration
0    110       130     409.1        60
1    117       145     479.0        60

In [117]:
#Making two columns as index col
new_df = df.set_index(['Duration','Pulse'])
new_df.head(2)

                Maxpulse  Calories
Duration Pulse
60       110         130     409.1
         117         145     479.0

In [123]:
import warnings
# suppress warnings
warnings.filterwarnings('ignore')

In [125]:
new_df.loc[60,110].head()

                Maxpulse  Calories
Duration Pulse
60       110         130     409.1
         110         136     374.0
         110         150     409.4
         110         145     300.0

In [126]:
new_df.loc[[(60,100),(60,110)]]

                Maxpulse  Calories
Duration Pulse
60       100         120     250.7
         100         120     300.0
         100         120     250.0
         100         132     280.0
         100         120     300.0
         100         120     300.0
         100         122     329.4
         100         120     270.4
         110         130     409.1
         110         136     374.0
         110         150     409.4
         110         145     300.0

**Data Cleaning**

Data cleaning means fixing bad data in your data set.

**Empty Cells (NaN)**

Empty cells can potentially give you a wrong result when you analyze data.

**Remove Rows**

One way to deal with empty cells is to remove rows that contain empty cells.

This is usually OK, since data sets can be very big, and removing a few rows will not have a big impact on the result.

Note: By default, the dropna() method returns a new DataFrame, and will not change the original.

If you want to change the original DataFrame, use the inplace = True argument:

In [130]:
import pandas as pd

df = pd.read_csv('unclean_data.txt')
df.head(33)

     Duration          Date  Pulse  Maxpulse  Calories
0          60  '2020/12/01'    110       130     409.1
1          60  '2020/12/02'    117       145     479.0
2          60  '2020/12/03'    103       135     340.0
3          45  '2020/12/04'    109       175     282.4
4          45  '2020/12/05'    117       148     406.0
5          60  '2020/12/06'    102       127     300.0
6          60  '2020/12/07'    110       136     374.0
7         450  '2020/12/08'    104       134     253.3
8          30  '2020/12/09'    109       133     195.1
9          60  '2020/12/10'     98       124     269.0
10         60  '2020/12/11'    103       147     329.3
11         60  '2020/12/12'    100       120     250.7
12         60  '2020/12/12'    100       120     250.7
13         60  '2020/12/13'    106       128     345.3
14         60  '2020/12/14'    104       132     379.3
15         60  '2020/12/15'     98       123     275.0
16         60  '2020/12/16'     98       120     215.2
17         60  '2020/12/17'    100       120     300.0
18         45  '2020/12/18'     90       112       NaN
19         60  '2020/12/19'    103       123     323.0
20         45  '2020/12/20'     97       125     243.0
21         60  '2020/12/21'    108       131     364.2
22         45           NaN    100       119     282.0
23         60  '2020/12/23'    130       101     300.0
24         45  '2020/12/24'    105       132     246.0
25         60  '2020/12/25'    102       126     334.5
26         60    2020/12/26    100       120     250.0
27         60  '2020/12/27'    921        18     241.0
28         60  '2020/12/28'    103       132       NaN
29         60  '2020/12/29'    100       132     280.0
30         60  '2020/12/30'    102       129     380.3
31         60  '2020/12/31'     92       115     243.0

In [132]:
new_df = df.dropna()
# df.dropna(inplace = True)

In [133]:
new_df.shape

(29, 5)

**Replace Empty Values**

Another way of dealing with empty cells is to insert a new value instead.

This way you do not have to delete entire rows just because of some empty cells.

The fillna() method allows us to replace empty cells with a value:

In [138]:
# Missing values in dataframe
## fill missing data with a scalar 0
df.fillna(0, inplace=True)

**Replace Using Mean, Median, or Mode**

A common way to replace empty cells, is to calculate the mean, median or mode value of the column.

Pandas uses the mean() median() and mode() methods to calculate the respective values for a specified column:

Mean = the average value (the sum of all values divided by number of values).

Median = the value in the middle, after you have sorted all values ascending.

Mode = the value that appears most frequently.

In [141]:
df = pd.read_csv('data.csv')

# Calculate the MEAN, and replace any empty values with it:
x = df["Calories"].mean()
df["Calories"].fillna(x, inplace = True)

# Calculate the MEDIAN, and replace any empty values with it:
x = df["Calories"].median()
df["Calories"].fillna(x, inplace = True)

# Calculate the MODE, and replace any empty values with it:
x = df["Calories"].mode()[0]
df["Calories"].fillna(x, inplace = True)
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

**Removing Duplicates**

To discover duplicates, we can use the duplicated() method.
The duplicated() method returns a Boolean values for each row

To remove duplicates, use the drop_duplicates() method.

In [142]:
# Returns True for every row that is a duplicate, otherwise False:
print(df.duplicated())

#Remove all duplicates:
df.drop_duplicates(inplace = True)

0      False
1      False
2      False
3      False
4      False
       ...
164    False
165    False
166    False
167    False
168    False
Length: 169, dtype: bool

In [144]:
df = pd.read_csv('data.csv')
df = df.set_index('Duration')
df.head(2)

          Pulse  Maxpulse  Calories
Duration
60          110       130     409.1
60          117       145     479.0

In [145]:
df = df.sort_index()
df.head(2)

          Pulse  Maxpulse  Calories
Duration
15          124       139     124.2
15           80       100      50.5

In [146]:
#Replace function
df = pd.DataFrame({'A' : [1,2,3,1],
                   'B' : [3,80,90,100],
                   'C' :['a','b','c','d']})
df.replace(1,100) #replace 1 with 100

     A    B  C
0  100    3  a
1    2   80  b
2    3   90  c
3  100  100  d

In [147]:
df.replace([1,3],[100,300]) #replace 1 with 100 and 3 with 300

     A    B  C
0  100  300  a
1    2   80  b
2  300   90  c
3  100  100  d

**Manipulating a dataframe**

Apply function

In [149]:
#Manipulating a dataframe
df = pd.read_csv('us-500.csv')
df.head(3)

,first_name,last_name,company_name,address,city,county,state,zip,phone1,phone2,email,web
0,James,Butt,"Benton, John B Jr",6649 N Blue Gum St,New Orleans,Orleans,LA,70116,504-621-8927,504-845-1427,jbutt@gmail.com,http://www.bentonjohnbjr.com
1,Josephine,Darakjy,"Chanay, Jeffrey A Esq",4 B Blue Ridge Blvd,Brighton,Livingston,MI,48116,810-292-9388,810-374-9840,josephine_darakjy@darakjy.org,http://www.chanayjeffreyaesq.com
2,Art,Venere,"Chemel, James L Cpa",8 W Cerritos Ave #54,Bridgeport,Gloucester,NJ,8014,856-636-8749,856-264-4130,art@venere.org,http://www.chemeljameslcpa.com

In [154]:
df

,first_name,last_name,company_name,city,county,state,zip,phone1,phone2,email,web
0,James,Butt,"Benton, John B Jr",New Orleans,Orleans,LA,70116,504-621-8927,504-845-1427,jbutt@gmail.com,http://www.bentonjohnbjr.com
1,Josephine,Darakjy,"Chanay, Jeffrey A Esq",Brighton,Livingston,MI,48116,810-292-9388,810-374-9840,josephine_darakjy@darakjy.org,http://www.chanayjeffreyaesq.com
2,Art,Venere,"Chemel, James L Cpa",Bridgeport,Gloucester,NJ,8014,856-636-8749,856-264-4130,art@venere.org,http://www.chemeljameslcpa.com
3,Lenna,Paprocki,Feltz Printing Service,Anchorage,Anchorage,AK,99501,907-385-4412,907-921-2010,lpaprocki@hotmail.com,http://www.feltzprintingservice.com
4,Donette,Foller,Printing Dimensions,Hamilton,Butler,OH,45011,513-570-1893,513-549-4561,donette.foller@cox.net,http://www.printingdimensions.com
...,...,...,...,...,...,...,...,...,...,...,...
495,Brittni,Gillaspie,Inner Label,Boise,Ada,ID,83709,208-709-1235,208-206-9848,bgillaspie@gillaspie.com,http://www.innerlabel.com
496,Raylene,Kampa,Hermar Inc,Elkhart,Elkhart,IN,46514,574-499-1454,574-330-1884,rkampa@kampa.org,http://www.hermarinc.com
497,Flo,Bookamer,Simonton Howe & Schneider Pc,Alliance,Box Butte,NE,69301,308-726-2182,308-250-6987,flo.bookamer@cox.net,http://www.simontonhoweschneiderpc.com
498,Jani,Biddy,Warehouse Office & Paper Prod,Seattle,King,WA,98104,206-711-6498,206-395-6284,jbiddy@yahoo.com,http://www.warehouseofficepaperprod.com
499,Chauncey,Motley,Affiliated With Travelodge,Orlando,Orange,FL,32804,407-413-4842,407-557-8857,chauncey_motley@aol.com,http://www.affiliatedwithtravelodge.com

In [155]:
column_to_present = ['first_name', 'last_name', 'company_name', 'city', 'county', 'zip']
df = df[column_to_present]
df.head(3)

  first_name last_name           company_name         city      county    zip
0      James      Butt      Benton, John B Jr  New Orleans     Orleans  70116
1  Josephine   Darakjy  Chanay, Jeffrey A Esq     Brighton  Livingston  48116
2        Art    Venere    Chemel, James L Cpa   Bridgeport  Gloucester   8014

In [156]:
#.apply() function to get full name by extracting first_name and last_name
def fullname(row):
    row['ful_name'] = row['first_name'] + ' ' + row['last_name']
    return row

df = df.apply(fullname, axis='columns')
df.head(2)

,first_name,last_name,company_name,city,county,zip,ful_name
0,James,Butt,"Benton, John B Jr",New Orleans,Orleans,70116,James Butt
1,Josephine,Darakjy,"Chanay, Jeffrey A Esq",Brighton,Livingston,48116,Josephine Darakjy

In [157]:
#split full name in first and last
def split_full_name(row):
    row['first'] = row['ful_name'].split(' ')[0]
    row['last'] = row['ful_name'].split(' ')[1]
    return row

df = df.apply(split_full_name, axis='columns')
df.head(2)

,first_name,last_name,company_name,city,county,zip,ful_name,first,last
0,James,Butt,"Benton, John B Jr",New Orleans,Orleans,70116,James Butt,James,Butt
1,Josephine,Darakjy,"Chanay, Jeffrey A Esq",Brighton,Livingston,48116,Josephine Darakjy,Josephine,Darakjy

In [161]:
import numpy as np

In [164]:
df = pd.DataFrame([ {'C1':23, 'C2':3422, 'C3':1287, 'C4':6689, 'C5':6776 },
                   {'C1':778, 'C2':3124, 'C3':8327, 'C4':8965, 'C5':6976 },
                   {'C1':778, 'C2':3214, 'C3':8744, 'C4':8943, 'C5':9876 },
                   {'C1':233, 'C2':3224, 'C3':8741, 'C4':3489, 'C5':1321 },
                   {'C1':2128, 'C2':2334, 'C3':6787, 'C4':1289, 'C5':7252 }])
df
def min_max(row):
    data = row[['C1','C2','C3','C4','C5']]
    row['min'] = np.min(data)
    row['max'] = np.max(data)
    return row
df.apply(min_max, axis='columns')

     C1    C2    C3    C4    C5   min   max
0    23  3422  1287  6689  6776    23  6776
1   778  3124  8327  8965  6976   778  8965
2   778  3214  8744  8943  9876   778  9876
3   233  3224  8741  3489  1321   233  8741
4  2128  2334  6787  1289  7252  1289  7252

In [165]:
#return min max as seperate series
def min_max(row):
    data = row[['C1','C2','C3','C4','C5']]
    return pd.Series({'min':np.min(data), 'max':np.max(data)})
df.apply(min_max, axis='columns')

    min   max
0    23  6776
1   778  8965
2   778  9876
3   233  8741
4  1289  7252

**Merging DataFrame**

In [166]:
#Merging DataFrame
staff_df = pd.DataFrame([{'Name':'Shahid', 'Role': 'HoD'},
                         {'Name':'Ali', 'Role': 'Lecturer'},
                         {'Name': 'John',  'Role': 'Grader'}])

student_df = pd.DataFrame([{'Name':'Hassan', 'School': "Business"},
                           {'Name':'Ali', 'School':'Law'},
                           {'Name': 'John', 'School':'Engg'}])

staff_df = staff_df.set_index('Name')
student_df = student_df.set_index('Name')
#Union (All whether staff or student)
pd.merge(staff_df, student_df, how='outer', left_index=True, right_index=True)

            Role    School
Name
Ali     Lecturer       Law
Hassan       NaN  Business
John      Grader      Engg
Shahid       HoD       NaN

In [167]:
#Intersection (Only those who are both staff as well as student)
pd.merge(staff_df, student_df, how='inner', left_index=True, right_index=True)

          Role School
Name
Ali   Lecturer    Law
John    Grader   Engg

In [168]:
#All staff
pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

            Role School
Name
Shahid       HoD    NaN
Ali     Lecturer    Law
John      Grader   Engg

In [169]:
#All students
pd.merge(staff_df, student_df, how='right', left_index=True, right_index=True)

            Role    School
Name
Hassan       NaN  Business
Ali     Lecturer       Law
John      Grader      Engg

In [170]:
#Using on parameter
staff_df = staff_df.reset_index()
student_df = student_df.reset_index()
#All Students
pd.merge(staff_df, student_df, how='right', on='Name')

     Name      Role    School
0  Hassan       NaN  Business
1     Ali  Lecturer       Law
2    John    Grader      Engg

In [171]:
#In case of conflict in data
staff_df = pd.DataFrame([{'Name':'Shahid', 'Role': 'HoD', 'location':'Deanz'},
                         {'Name':'Ali', 'Role': 'Lecturer', 'location':'Saddar'},
                         {'Name': 'John',  'Role': 'Grader', 'location':'Deans'}])

student_df = pd.DataFrame([{'Name':'Hassan', 'School': "Business", 'location': "Saddar House#22"},
                           {'Name':'Ali', 'School':'Law', 'location':'Peshawar House#33'},
                           {'Name': 'John', 'School':'Engg', 'location': 'Islamabad House#44'}])

pd.merge(staff_df, student_df, how='left', on='Name')

     Name      Role location_x School          location_y
0  Shahid       HoD      Deanz    NaN                 NaN
1     Ali  Lecturer     Saddar    Law   Peshawar House#33
2    John    Grader      Deans   Engg  Islamabad House#44

In [174]:
#Multi indexing and multiple columns
staff_df = pd.DataFrame([{'First Name':'Shahid', 'Last Name':'Hussain', 'Role': 'HoD'},
                         {'First Name':'Ali', 'Last Name':'Hassan', 'Role': 'Lecturer'},
                         {'First Name': 'John', 'Last Name':'Abbas', 'Role': 'Grader'}])

student_df = pd.DataFrame([{'First Name':'Hassan', 'Last Name':'Shah', 'School': "Business"},
                           {'First Name':'Ali', 'Last Name':'Hussain', 'School':'Law'},
                           {'First Name': 'John', 'Last Name':'Abbas', 'School':'Engg'}])

pd.merge(staff_df, student_df, how='inner', on=['First Name', 'Last Name'])

  First Name Last Name    Role School
0       John     Abbas  Grader   Engg